<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# SQL Exam
© ExploreAI Academy

## Instructions to students

This challenge is designed to determine how much you have learned so far and will test your knowledge on SQL.

The answers for this challenge should be selected on Athena for each corresponding multiple-choice question. The questions are included in this notebook and are numbered according to the Athena questions. The options for each question have also been included.

Do not add or remove cells in this notebook. Do not edit or remove the `%%sql` comment as it is required to run each cell.

**_Good luck!_**

In [1]:
!pip install ipython-sql
!pip install sqlAlchemy==2.0

Requirement already satisfied: ipython-sql in c:\users\user\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: prettytable in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (3.9.0)
Requirement already satisfied: ipython-genutils in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (2.0.0)
Requirement already satisfied: sqlparse in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: ipython in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (7.31.1)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.3.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (1.1.1)
Requirement already satisfied: matplotlib-inline in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: pygments in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: jedi>=0.16 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: setuptools>=18.5 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (63.4.1)
Requirement already satisfied: traitlets>=4.2 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: pickleshare in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: colorama in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.5)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.20)
Requirement already satisfied: backcall in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: decorator in c:\users\user\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: wcwidth in c:\users\user\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\user\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: sqlAlchemy==2.0 in c:\users\user\anaconda3\lib\site-packages (2.0.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\user\anaconda3\lib\site-packages (from sqlAlchemy==2.0) (4.3.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlAlchemy==2.0) (1.1.1)

## Honour code

I, ANNETE BOSIBORI, confirm – by submitting this document – that the solutions in this notebook are a result of my own work and that I abide by the EDSA honour code (https://drive.google.com/file/d/1QDCjGZJ8-FmJE3bZdIQNwnJyQKPhHZBn/view?usp=sharing).

Non-compliance with the honour code constitutes a material breach of contract.

## The TMDb database

In this supplementary exam, you will be exploring [The Movie Database](https://www.themoviedb.org/) – an online movie and TV show database that houses some of the most popular movies and TV shows at your fingertips. The TMDb database supports 39 official languages used in over 180 countries daily and dates back all the way to 2008. 


<img src="https://github.com/Explore-AI/Pictures/blob/master/sql_tmdb.jpg?raw=true" width=80%/>


Below is an Entity Relationship Diagram (ERD) of the TMDb database:

<img src="https://github.com/Explore-AI/Pictures/blob/master/TMDB_ER_diagram.png?raw=true" width=70%/>

As can be seen from the ERD, the TMDb database consists of `12 tables` containing information about movies, cast, genre, and so much more.  

Let's get started!

## Loading the database

Before you begin, you need to prepare your SQL environment.  You can do this by loading the magic command `%load_ext sql`.

In [2]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

Next, go ahead and load your database. To do this, you will need to ensure you have downloaded the `TMDB.db` sqlite file from Athena and have stored it in a known location.

In [3]:
# Establish a connection to the local database using the '%sql' magic command.
# Replace 'password' with our connection password and `db_name` with our database name. 
# If you get an error here, please make sure the database name or password is correct.

%sql sqlite:///TMDB-a-4006.db

In [7]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///TMDB-a-4006.db
Done.

[('actors',),
 ('casts',),
 ('genremap',),
 ('genres',),
 ('keywordmap',),
 ('keywords',),
 ('languagemap',),
 ('languages',),
 ('movies',),
 ('oscars',),
 ('productioncompanies',),
 ('productioncompanymap',),
 ('productioncountries',),
 ('productioncountrymap',),
 ('sysdiagrams',)]

If the above line didn't throw out any errors, then you should be good to go. Good luck with the exam!

In [14]:
%%sql 
SELECT*
FROM casts
LIMIT 10;

 * sqlite:///TMDB-a-4006.db
Done.

[(5, 62, 'Leo'),
 (5, 138, 'Chester Rush'),
 (5, 2545, 'Long Hair Yuppy Scum'),
 (5, 2555, 'Siegfried'),
 (5, 3122, 'Jezebel'),
 (5, 3123, 'Diana'),
 (5, 3124, 'Athena'),
 (5, 3125, 'Elspeth'),
 (5, 3126, 'Eva'),
 (5, 3127, 'Raven')]

## Questions on SQL

Use the given cell below each question to execute your SQL queries to find the correct input from the options provided. Your solution should match one of the multiple-choice questions on Athena.

### Question 1

Who won the Oscar for “Actor in a Leading Role” in  2015?

(Hint: The winner is indicated as '1.0'.)

**Options:** 

  - Micheal Fassbender
  - Natalie Portman
  - Leonardo DiCaprio
  - Eddie Redmayne

In [40]:
#Leornardo Dicaprio
%%sql
SELECT*
FROM oscars
WHERE year = 2015
AND award = 'Actor in a Leading Role'
AND winner = 1.0;

 * sqlite:///TMDB-a-4006.db
Done.

[('2015', 'Actor in a Leading Role', '1.0', 'Leonardo DiCaprio', 'The Revenant')]

### Question 2

What query will produce the ten oldest movies in the database?

**Options:**

 - SELECT TOP(10) * FROM movies WHERE release_date ORDER BY release_date ASC

 - SELECT  * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date ASC LIMIT 10

 - SELECT * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date DESC LIMIT 10

 -  SELECT * FROM movies WHERE release_date IS NULL ORDER BY release_date DESC LIMIT 10

In [47]:
%%sql
SELECT *
FROM movies
WHERE release_date IS NOT NULL
ORDER BY release_date DESC
LIMIT 10;
#answer SELECT * FROM movies WHERE release_date IS NOT NULL ORDER BY release_date DESC LIMIT 10

 * sqlite:///TMDB-a-4006.db
Done.

[(426469, 'Growing Up Smith', '2017-02-03 00:00:00.000000', 0, 'http://www.growingupsmithmovie.com', 'en', 'Growing Up Smith', '"In 1979, an Indian family moves to America with hopes of living the American Dream. While their 10-year-old boy Smith falls head-over-heels for the girl next door, his desire to become a ""good old boy"" propels him further away from his family\'s ideals than ever before."', 0.71087, 0.0, 102.0, 'Released', 'ItÆs better to stand out than to fit in.', 7.4, 7),
 (325373, 'Two Lovers and a Bear', '2016-10-02 00:00:00.000000', 0, None, 'en', 'Two Lovers and a Bear', 'Set in a small town near the North Pole where roads lead to nowhere, the story follows Roman and Lucy, two burning souls who come together to make a leap for life and inner peace.', 3.139294, 0.0, 96.0, 'Released', None, 6.8, 27),
 (374461, 'Mr. Church', '2016-09-16 00:00:00.000000', 8000000, None, 'en', 'Mr. Church', 'A unique friendship develops when a little girl and her dying mother inherit a cook - Mr. Church. What begins as an arrangement that should only last six months, instead spans fifteen years.', 7.828459, 0.0, 104.0, 'Released', 'He was the one person she could always count on.', 7.0, 129),
 (339408, 'The Birth of a Nation', '2016-09-09 00:00:00.000000', 8500000, 'http://www.foxsearchlight.com/thebirthofanation/', 'en', 'The Birth of a Nation', 'Nat Turner, a former slave in America, leads a liberation movement in 1831 to free African-Americans in Virgina that results in a violent retaliation from whites.', 9.452808, 15861566.0, 120.0, 'Released', 'The Untold Story of Nat Turner', 6.5, 178),
 (385736, 'Kicks', '2016-09-09 00:00:00.000000', 0, 'http://www.focusfeatures.com/kicks', 'en', 'Kicks', 'When his hard-earned kicks get snatched by a local hood, fifteen-year old Brandon and his two best friends go on an ill-advised mission across the Bay Area to retrieve the stolen sneakers.', 3.467923, 0.0, 80.0, 'Released', "They aren't just shoes", 7.5, 18),
 (332285, 'Antibirth', '2016-09-02 00:00:00.000000', 35000000, None, 'en', 'Antibirth', 'In a desolate community full of drug-addled Marines and rumors of kidnapping, a wild-eyed stoner named Lou wakes up after a crazy night of partying with symptoms of a strange illness and recurring visions. As she struggles to get a grip on reality, the stories of conspiracy spread.', 3.674294, 0.0, 94.0, 'Released', None, 4.8, 40),
 (184341, 'Hands of Stone', '2016-08-26 00:00:00.000000', 20000000, None, 'en', 'Hands of Stone', "The legendary Roberto Duran and his equally legendary trainer Ray Arcel change each other's lives.", 7.444189, 0.0, 105.0, 'Released', 'No mßs. No surrender.', 6.1, 109),
 (271969, 'Ben-Hur', '2016-08-17 00:00:00.000000', 100000000, 'http://www.benhurmovie.com/', 'en', 'Ben-Hur', 'A falsely accused nobleman survives years of slavery to take vengeance on his best friend who betrayed him.', 29.608322, 94061311.0, 125.0, 'Released', 'First to finish. Last to die.', 5.3, 621),
 (294272, "Pete's Dragon", '2016-08-10 00:00:00.000000', 65000000, 'http://movies.disney.com/petes-dragon-2016', 'en', "Pete's Dragon", 'Pete is a mysterious 10-year-old with no family and no home who claims to live in the woods with a giant, green dragon named Elliott. With the help o ... (42 characters truncated) ... r Jack owns the local lumber mill, forest ranger Grace sets out to determine where Pete came from, where he belongs, and the truth about this dragon.', 31.974359, 143695338.0, 102.0, 'Released', 'Some secrets are too big to keep.', 6.2, 679),
 (297761, 'Suicide Squad', '2016-08-02 00:00:00.000000', 175000000, 'http://www.suicidesquad.com/', 'en', 'Suicide Squad', 'From DC Comics comes the Suicide Squad, an antihero team of incarcerated supervillains who act as deniable assets for the United States government, undertaking high-risk black ops missions in exchange for commuted prison sentences.', 90.23792, 745000000.0, 123.0, 'Released', 'Worst Heroes Ever', 5.9, 7458)]

### Question 3

How many unique awards are there in the Oscars table?

**Options:**
 - 141
 - 53 
 - 80
 - 114

In [50]:
%%sql
SELECT COUNT(DISTINCT award)
FROM oscars;
#answer 114

 * sqlite:///TMDB-a-4006.db
Done.

[(114,)]

### Question 4

How many movies are there that contain the word “Spider” within their title?

**Options:**
 - 0
 - 5
 - 1
 - 9

In [53]:
%%sql
SELECT COUNT(title)
FROM MOVIES
WHERE title LIKE '%Spider%'
#answer is 9

 * sqlite:///TMDB-a-4006.db
Done.

[(9,)]

### Question 5

How many movies are there that are both in the "Thriller" genre and contain the word “love” anywhere in the keywords?


**Options:**
 - 48
 - 38
 - 14
 - 1

In [68]:
%%sql
WITH thriller AS (
    SELECT 
        Keywords.Keyword_id,
        Keywords.Keyword_name,
        Genres.Genre_id,
        Genres.Genre_name,
        Genremap.Movie_id,
        Movies.Title
    FROM 
        Keywords
        JOIN Keywordmap ON Keywords.Keyword_id = keywordmap.keyword_id
        JOIN movies ON keywordmap.movie_id = movies.movie_id
        JOIN genremap ON movies.movie_id = genremap.movie_id
        JOIN genres ON genres.genre_id = genremap.genre_id)
SELECT
COUNT(DISTINCT T.movie_id)
FROM thriller as T
WHERE keyword_name LIKE '%love%' and Genre_name = 'Thriller';

#answer is 48

 * sqlite:///TMDB-a-4006.db
Done.

[(48,)]

### Question 6

How many movies are there that were released between 1 August 2006 ('2006-08-01') and 1 October 2009 ('2009-10-01') that have a popularity score of more than 40 and a budget of less than 50 000 000?

 
**Options:**

 - 29
 - 23
 - 28
 - 35

In [70]:
%%sql
SELECT COUNT(*)
FROM movies
where release_date >= '2006-08-01'
     and release_date <= '2009-10-01'
    and popularity > 40
    and budget < 50000000
#answer 29

 * sqlite:///TMDB-a-4006.db
Done.

[(29,)]

### Question 7

How many unique characters has "Vin Diesel" played so far in the database?

**Options:**
 - 24
 - 19
 - 18
 - 16

In [73]:
%%sql
SELECT COUNT(DISTINCT characters)
FROM
    actors a
JOIN 
    casts c
    ON a.actor_id = c.actor_id
WHERE 
    actor_name LIKE '%Vin Diesel%';

#answer 16

 * sqlite:///TMDB-a-4006.db
Done.

[(16,)]

### Question 8

What are the genres of the movie “The Royal Tenenbaums”?


**Options:**
 - Action, Romance
 - Drama, Comedy
 - Crime, Thriller
 - Drama, Romance

In [77]:
%%sql
SELECT genre_name
FROM movies
JOIN genremap ON movies.movie_id = genremap.movie_id
JOIN genres ON genremap.genre_id = genres.genre_id
WHERE title = 'The Royal Tenenbaums';
#answer is Drama, Romance

 * sqlite:///TMDB-a-4006.db
Done.

[('Drama',), ('Comedy',)]

 Question 9

What are the three production companies that have the highest movie popularity score on average, as recorded within the database?


**Options:**

 - MCL Films S.A., Turner Pictures, and George Stevens Productions
 - The Donners' Company, Bulletproof Cupid, and Kinberg Genre
 - Bulletproof Cupid, The Donners' Company, and MCL Films S.A
 - B.Sting Entertainment, Illumination Pictures, and Aztec Musique

In [81]:
%%sql
SELECT pc.production_company_name,
AVG(m.popularity) AS avg_popularity
FROM
productioncompanies pc
JOIN productioncompanymap pcm ON pc.production_company_id = pcm.production_company_id
JOIN movies m ON pcm.movie_id = m.movie_id
GROUP BY pc.production_company_name
ORDER BY
avg_popularity DESC
LIMIT 3;
#The Donners' Company, Bulletproof Cupid, and Kinberg Genre

 * sqlite:///TMDB-a-4006.db
Done.

[("The Donners' Company", 514.569956),
 ('Bulletproof Cupid', 481.098624),
 ('Kinberg Genre', 326.92099900000005)]

### Question 10

How many female actors (i.e. gender = 1) have a name that starts with the letter "N"?


**Options:**

 - 0
 - 355
 - 7335
 - 1949

In [82]:
%%sql
SELECT COUNT(*) AS female_actors_count
FROM actors
WHERE gender = 1
AND actor_name LIKE 'N%';
#answer 355

 * sqlite:///TMDB-a-4006.db
Done.

[(355,)]

### Question 11

Which genre has, on average, the lowest movie popularity score? 


**Options:**

 - Science Fiction
 - Animation
 - Documentary
 - Foreign

In [83]:
%%sql
SELECT
    genre_name,
    AVG(popularity) AS avg_popularity
FROM
    genres
JOIN
    genremap ON genres.genre_id = genremap.genre_id
JOIN
    movies ON genremap.movie_id = movies.movie_id
GROUP BY
    genre_name
ORDER BY
    avg_popularity ASC
LIMIT 1;
#foreign

 * sqlite:///TMDB-a-4006.db
Done.

[('Foreign', 0.686786794117647)]

### Question 12

Which award category has the highest number of actor nominations (actors can be male or female)? (Hint: `Oscars.name` contains both actors' names and film names.)

**Options:**

- Special Achievement Award
- Actor in a Supporting Role
- Actress in a Supporting Role
- Best Picture

In [103]:
%%sql
SELECT COUNT(award) AS nomination_count, award
FROM oscars
JOIN actors ON actors.actor_name = oscars.name
GROUP BY award
ORDER BY award DESC;
#actor in supporting role

 * sqlite:///TMDB-a-4006.db
Done.

[(14, 'Special Award'),
 (2, 'Special Achievement Award'),
 (1, 'John A. Bonner Medal of Commendation'),
 (15, 'Jean Hersholt Humanitarian Award'),
 (12, 'Irving G. Thalberg Memorial Award'),
 (35, 'Honorary Award'),
 (1, 'Gordon E. Sawyer Award'),
 (2, 'Directing (Dramatic Picture)'),
 (4, 'Directing'),
 (1, 'Cinematography'),
 (331, 'Actress in a Supporting Role'),
 (198, 'Actress in a Leading Role'),
 (145, 'Actress'),
 (356, 'Actor in a Supporting Role'),
 (197, 'Actor in a Leading Role'),
 (184, 'Actor')]

### Question 13

For all of the entries in the Oscars table before 1934, the year is stored differently than in all the subsequent years. For example, the year would be saved as “1932/1933” instead of just “1933” (the second indicated year).  Which of the following options would be the appropriate code to update this column to have the format of the year be consistent throughout the entire table (second indicated year only shown)?


**Options:**

- `UPDATE Oscars SET year = RIGHT(year, -4)`
- `UPDATE Oscars SET year = SELECT substr(year, -4)`
- `UPDATE Oscars SET year = substr(year, -4)`
- `UPDATE Oscars year =  substr(year, 4)`

In [91]:
%%sql
UPDATE Oscars SET year = SUBSTR(year, -4);

 * sqlite:///TMDB-a-4006.db
9964 rows affected.

[]

### Question 14

DStv will be having a special week dedicated to the actor Alan Rickman. Which of the following queries would create a new _view_ that shows the titles, release dates, taglines, and overviews of all movies that Alan Rickman has played in?



**Options:**

- SELECT title, release_date, tagline, overview 
FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id 
WHERE Actors.actor_name = 'Alan Rickman'
AS VIEW Alan_Rickman_Movies

- CREATE VIEW Alan_Rickman_Movies AS  
SELECT title, release_date, tagline, overview FROM Movies  
LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors
ON Casts.actor_id = Actors.actor_id
WHERE Actors.actor_name = 'Alan Rickman' 


- CREATE NEW VIEW  Name  = Alan_Rickman_Movies AS SELECT title, release_date, tagline, overview FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

- VIEW Alan_Rickman_Movies AS SELECT title, release_date, tagline, overview FROM Movies LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

In [ ]:

CREATE VIEW Alan_Rickman_Movies AS
SELECT title, release_date, tagline, overview FROM Movies
LEFT JOIN Casts ON Casts.movie_id = Movies.movie_id Left JOIN Actors ON Casts.actor_id = Actors.actor_id WHERE Actors.actor_name = 'Alan Rickman'

### Question 15

Which of the statements about database normalisation are true?

**Statements:**
 
i) Database normalisation improves data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

ii) Database normalisation supports up to the Third Normal Form and removes all data anomalies.

iii) Database normalisation removes inconsistencies that may cause the analysis of our data to be more complicated.

iv) Database normalisation increases data redundancy, saves on storage space, and fulfils the requirement of records to be uniquely identified.

**Options:**

 - (i) and (ii)
 - (i) and (iii)
 - (ii) and (iv)
 - (iii) and (iv)

In [ ]:
(i) and (iii)

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>